app/controllers/contacts_controller.rb

  def new
    if Contact.where(user_id: current_user.id).count == 5
---
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."user_id" = ?  [["user_id", 2]]

  def create
      @contact = Contact.new(contact_params)
      @contact.user_id = current_user.id

      if Contact.where(user_id: current_user.id, cellphone: @contact.cellphone).exists?
        #Checking if contact is already registed with this code
        #because using uniqueness: true at model will avoid
        #different users having the same contact, which is a valid scenario
        #TODO: make this alert call take style from _alerts
        #FIXME: validate this at model with dedicated function
        redirect_to new_contact_path, :alert => 'You have already registered this contact'
      else
        respond_to do |format|
        if @contact.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "contacts" WHERE "contacts"."user_id" = ? AND "contacts"."cellphone" = ? LIMIT ?  [["user_id", 2], ["cellphone", "1231231231"], ["LIMIT", 1]]
INSERT INTO "contacts" ("fname", "lname", "cellphone", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["fname", "Test"], ["lname", "Test"], ["cellphone", "1231231232"], ["user_id", 2], ["created_at", "2020-04-03 09:14:43.593772"], ["updated_at", "2020-04-03 09:14:43.593772"]]