app/models/contact.rb

SELECT 1 AS one FROM "admin_devices" WHERE "admin_devices"."serial" = ? LIMIT ?  [["serial", "1234567891"], ["LIMIT", 1]]
---
	def validate_cellphone
		#FIXME, make this work so validation is done here and not at controller
		#if Contact.where(user_id: self.user_id, cellphone: self.cellphone).exists?
		#	errors.add(:contact, 'is already registered')
		#else
		if AdminDevice.where(serial: self.cellphone).exists?